
    // этот метод всегда возвращает ноль. А должен возвращать сумму a и b
    function sum(a, b) {
        return 0
    }

    // этот метод всегда возвращает ноль. А должен возвращать разницу a и b
    function sub(a, b) {
        return 0
    }

    /*
    По аналогии, необходимо реализовать методы:
        multiply(x, y) - умножение
        div(x, y) - деление

        percent(num, share) - расчет процента, где num - целое число, а share - искомая доля.
    */

// через запятую, добавляйте имена функций, когда их напишите: multiply, div, percent
module.exports = {sum, sub}
